; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	satellite5 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite6 - satellite
	instrument9 - instrument
	image1 - mode
	infrared0 - mode
	GroundStation6 - direction
	Star2 - direction
	GroundStation7 - direction
	GroundStation1 - direction
	GroundStation5 - direction
	GroundStation0 - direction
	GroundStation4 - direction
	Star3 - direction
	Star8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation7)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation7)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
	(supports instrument2 image1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 GroundStation6)
	(supports instrument3 infrared0)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation7)
	(calibration_target instrument3 Star2)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation4)
	(supports instrument4 infrared0)
	(calibration_target instrument4 GroundStation0)
	(supports instrument5 image1)
	(calibration_target instrument5 Star3)
	(calibration_target instrument5 GroundStation7)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon11)
	(supports instrument6 image1)
	(supports instrument6 infrared0)
	(calibration_target instrument6 GroundStation0)
	(calibration_target instrument6 GroundStation1)
	(on_board instrument6 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation6)
	(supports instrument7 infrared0)
	(supports instrument7 image1)
	(calibration_target instrument7 GroundStation4)
	(calibration_target instrument7 GroundStation5)
	(supports instrument8 infrared0)
	(calibration_target instrument8 GroundStation0)
	(on_board instrument7 satellite5)
	(on_board instrument8 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Planet9)
	(supports instrument9 image1)
	(calibration_target instrument9 Star3)
	(calibration_target instrument9 GroundStation4)
	(on_board instrument9 satellite6)
	(power_avail satellite6)
	(pointing satellite6 GroundStation5)
)
(:goal (and
	(pointing satellite4 Star8)
	(pointing satellite5 GroundStation5)
	(pointing satellite6 Star3)
	(have_image Star8 image1)
	(have_image Planet9 image1)
	(have_image Phenomenon10 infrared0)
	(have_image Phenomenon11 infrared0)
	(have_image Phenomenon12 infrared0)
	(have_image Planet13 infrared0)
))

)

; plan
1. (turn_to satellite6 star3 groundstation5)
   deleted: (pointing satellite6 groundstation5)
   added: (pointing satellite6 star3)
   goals met: 1 of 9
2. (turn_to satellite5 groundstation5 planet9)
   deleted: (pointing satellite5 planet9)
   added: (pointing satellite5 groundstation5)
   goals met: 2 of 9
3. (turn_to satellite4 groundstation0 groundstation6)
   deleted: (pointing satellite4 groundstation6)
   added: (pointing satellite4 groundstation0)
   goals met: 2 of 9
4. (switch_on instrument6 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument6)
   goals met: 2 of 9
5. (calibrate satellite4 instrument6 groundstation0)
   added: (calibrated instrument6)
   goals met: 2 of 9
6. (turn_to satellite4 phenomenon12 groundstation0)
   deleted: (pointing satellite4 groundstation0)
   added: (pointing satellite4 phenomenon12)
   goals met: 2 of 9
7. (take_image satellite4 phenomenon12 instrument6 infrared0)
   added: (have_image phenomenon12 infrared0)
   goals met: 3 of 9
8. (turn_to satellite4 phenomenon11 phenomenon12)
   deleted: (pointing satellite4 phenomenon12)
   added: (pointing satellite4 phenomenon11)
   goals met: 3 of 9
9. (take_image satellite4 phenomenon11 instrument6 infrared0)
   added: (have_image phenomenon11 infrared0)
   goals met: 4 of 9
10. (turn_to satellite4 phenomenon10 phenomenon11)
   deleted: (pointing satellite4 phenomenon11)
   added: (pointing satellite4 phenomenon10)
   goals met: 4 of 9
11. (take_image satellite4 phenomenon10 instrument6 infrared0)
   added: (have_image phenomenon10 infrared0)
   goals met: 5 of 9
12. (turn_to satellite4 planet13 phenomenon10)
   deleted: (pointing satellite4 phenomenon10)
   added: (pointing satellite4 planet13)
   goals met: 5 of 9
13. (take_image satellite4 planet13 instrument6 infrared0)
   added: (have_image planet13 infrared0)
   goals met: 6 of 9
14. (turn_to satellite4 planet9 planet13)
   deleted: (pointing satellite4 planet13)
   added: (pointing satellite4 planet9)
   goals met: 6 of 9
15. (take_image satellite4 planet9 instrument6 image1)
   added: (have_image planet9 image1)
   goals met: 7 of 9
16. (turn_to satellite4 star8 planet9)
   deleted: (pointing satellite4 planet9)
   added: (pointing satellite4 star8)
   goals met: 8 of 9
17. (take_image satellite4 star8 instrument6 image1)
   added: (have_image star8 image1)
   goals met: 9 of 9
